{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2024-06-27T16:08:30.4119889Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2024-06-27T16:08:30.4119889Z",
    "name": "CIS (L2) Section 11.1 - 80 (No Services) (User) - Windows 11 Intune 3.0.1",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 1,
    "technologies": "mdm",
    "id": "1771f0f0-3066-483e-8587-a891ab702878",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "user_vendor_msft_policy_config_experience_allowwindowsspotlight",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "user_vendor_msft_policy_config_experience_allowwindowsspotlight_0",
                    "children": []
                }
            }
        }
    ]
}