{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2024-07-11T15:51:00.4716886Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2024-07-11T15:51:00.4716886Z",
    "name": "CIS (L1) Connected Devices - iOS/iPadOS Intune 1.0.0",
    "platforms": "iOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 1,
    "technologies": "mdm,appleRemoteManagement",
    "id": "00d63d6c-7c48-4eb8-9cb1-0a14195a9897",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.applicationaccess_com.apple.applicationaccess",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowairprintibeacondiscovery",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowairprintibeacondiscovery_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowautounlock",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowautounlock_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_allowfilesusbdriveaccess",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_allowfilesusbdriveaccess_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_forceairplayoutgoingrequestspairingpassword",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_forceairplayoutgoingrequestspairingpassword_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.applicationaccess_forcewatchwristdetection",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.applicationaccess_forcewatchwristdetection_true",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            }
        }
    ]
}