<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>PayloadUUID</key>
        <string>FBC7177C-4D4F-479D-BF79-6B10F943A0EE</string>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadOrganization</key>
        <string>MEM v ENNBEE</string>
        <key>PayloadIdentifier</key>
        <string>FBC7177C-4D4F-479D-BF79-6B10F943A0EE</string>
        <key>PayloadDisplayName</key>
        <string>Microsoft Defender for Endpoint settings</string>
        <key>PayloadDescription</key>
        <string>Microsoft Defender for Endpoint configuration settings</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>PayloadEnabled</key>
        <true/>
        <key>PayloadRemovalDisallowed</key>
        <false/>
        <key>PayloadScope</key>
        <string>System</string>
        <key>PayloadContent</key>
        <array>
            <dict>
                <key>PayloadUUID</key>
                <string>BC7CBA1A-85F2-4F91-9D9F-5A7B4DA63D21</string>
                <key>PayloadType</key>
                <string>com.microsoft.wdav</string>
                <key>PayloadOrganization</key>
                <string>MEM v ENNBEE</string>
                <key>PayloadIdentifier</key>
                <string>BC7CBA1A-85F2-4F91-9D9F-5A7B4DA63D21</string>
                <key>PayloadDisplayName</key>
                <string>Microsoft Defender for Endpoint configuration settings</string>
                <key>PayloadDescription</key>
                <string/>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PayloadEnabled</key>
                <true/>
                <key>features</key>
                <dict>
                    <key>scheduledScan</key>
                    <string>enabled</string>
                </dict>
                <key>scheduledScan</key>
                <dict>
                    <key>ignoreExclusions</key>
                    <True/>
                    <key>lowPriorityScheduledScan</key>
                    <True/>
                    <key>randomizeScanStartTime</key>
                    <integer>0</integer>
                    <key>checkForDefinitionsUpdate</key>
                    <True/>
                    <key>runScanWhenIdle</key>
                    <True/>
                    <key>weeklyConfiguration</key>
                    <dict>
                        <key>dayOfWeek</key>
                        <integer>4</integer>
                        <key>timeOfDay</key>
                        <integer>885</integer>
                        <key>scanType</key>
                        <string>full</string>
                    </dict>
                    <key>dailyConfiguration</key>
                    <dict>
                        <key>timeOfDay</key>
                        <integer>615</integer>
                        <key>interval</key>
                        <string>0</string>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
